{"pages":[],"posts":[{"title":"什么是ArcGIS","text":"ArcGIS简介ArcGIS 是一个全面的系统，用户可用其来收集、组织、管理、分析、交流和发布地理信息。作为世界领先的地理信息系统 (GIS) 构建和应用平台，ArcGIS 可供全世界的人们将地理知识应用到政府、企业、科技、教育和媒体领域。ArcGIS 可以发布地理信息，以便所有人都可以访问和使用。本系统可以在任何地点通过 web 浏览器、移动设备（例如智能手机和台式计算机）来使用。 ArcGIS有哪些功能 创建、共享和使用智能地图地图以一种有效的方式来组织、理解和传达大量信息，这种方式获得了普遍的认可。ArcGIS 可用于创建各种不同形式的地图，包括可以使用浏览器和移动设备访问的 web 地图、大幅面印刷地图、报告和演示文稿中包括的地图、地图册、地图集、嵌入应用程序的地图，等等。无论采用哪种发布形式，ArcGIS 地图作为一种智能地图都可以显示、集成与合成来自各种不同来源的丰富地理和描述性信息图层。 单击影像浏览地图或应用程序： The World Topographic Map by Esri incorporates data provided by the GIS community via the Community Maps Program. 编译地理信息ArcGIS 使您可以将多个来源的数据合成到一个统一的地理视图中。这些数据来源包括来自地理数据库的信息、来自数据库管理系统 (DBMS) 和其他企业级系统的表格数据、文件、电子表格、经地理标记的照片和视频、KML、CAD 数据、来自传感器的实时反馈、航空和卫星影像等。实际上，任何包含地理参考（例如街道地址、城市名称、地块标识符、GPS 坐标等）的信息记录，都可以在地图上定位和访问。Esri、数据提供商和世界各地成千上万的 GIS 机构和组织提供的即用型权威地理数据都可以包括在内。 创建和管理地理数据库地理数据库是专业 GIS 工作的核心。地理数据库使地理信息能够以结构化的形式存储，便于轻松管理、更新、重用和共享。ArcGIS 使您可以设计、创建、维护和使用地理数据库，无论您是单独工作还是在大企业工作。地理数据库通常用于存储和管理 GIS 中所使用的关键基础图层数据 - 例如宗地、行政边界、公用设施网络、设施点、水文、高程、土壤等图层。这些集中管理的数据可以在 ArcGIS 地图中以各种不同的方式进行符号化、呈现、处理和发布。 ArcGIS 支持特大型的多用户数据库，其中的数据可以由多个用户同时使用和编辑，允许来自多个工作组和部门的不同用户访问、管理和更新。例如，后台用户和外业工作人员可以同时进行更新，所有组都可以立即看到他们的同事做出的更改。这些多用户数据库可以在标准的企业级关系数据库系统中实现和支持，例如 Oracle、SQL Server、 PostgreSQL、Informix 和 DB2。 单击影像浏览地图或应用程序： This sample demonstrates how to create graphics with 3D symbols and how to update these graphics using SketchViewModel in a SceneView. 12345678910111213141516171819const sketchVM = new SketchViewModel({ layer: gLayer, view: view, polygonSymbol: { type: \"polygon-3d\", symbolLayers: [{ type: \"extrude\", size: 10, // extrude by 10 meters material: { color: white }, edges: { type: \"solid\", size: \"3px\", color: [82, 82, 122, 0.8] } }] }}); 使用空间分析解决问题空间分析是 GIS 中最引人注目的功能之一。空间分析的目标是根据您的数据产生新的信息，以更好的做出决策。符号化数据并在地图上查看它这一过程本身就是一种形式的分析，并且地图本身即是对所显示的模式和关系的解译，而空间分析通过对地图中的数据应用地理、统计和数学运算又向前迈进了一步。ArcGIS 拥有数百种分析工具和操作方式，它们可以用于解决各种类型的问题，从查找满足特定条件的要素，到构建自然过程模型（例如经过各种地形的水流），或使用空间统计工具确定哪一组样本点可以揭示某种现象的分布（例如空气质量或人口特征）。 创建基于地图的应用程序通过创建应用程序可以将您的 ArcGIS 地图、数据、工具和专业知识转化为任何人都可以使用的信息产品。这事实上可以展现您在 GIS 方面的投资，使您的地图和功能可供各种不同的用户使用。 iGeology is a free smartphone app that lets you take over 500 geological maps of Britain wherever you go to discover the landscape beneath your feet! 使用地理和可视化功能交流和共享信息 ArcGIS 具有一些不可思议的新工具来创建 3D 可视化效果，包括城市的真实照片渲染。这些 3D 地图将来自地理数据库的权威数据（包括在 3D 环境中查询数据的功能）与 3D 可视化效果的丰富性和熟悉性结合到一起。通过创建精美的动画视频可以显示数据的飞行轨迹，例如分析结果，或使人们可以轻松可视化不同时间的变化情况。","link":"/hexo-blog/2019/04/30/ArcGIS/"},{"title":"关于博客","text":"相关简介，后续更新，主要更新内容设计以下方面：VUE，AngularJS，react，ES6，webpack等前端方面的工作中接触到的以及个人总计的内容，另外关于ArcGIS服务器的相关部署，以及相关开发也会有较为详细的博文。针对于后端部分开发，由于本人着重于前端开发，后端开发也仅仅限于自己需求方面，所以水平上不及许多大牛，所以文章中如有写的不足或有错误的地方，还望大家多多指点，相互学习。","link":"/hexo-blog/2019/04/30/hello-world/"},{"title":"nginx服务器相关配置","text":"关于nginx服务器的相关接触，后续会陆续更新。","link":"/hexo-blog/2019/04/30/index/"},{"title":"vue-cli单页面开发","text":"关于vue-cli脚手架的搭建，以及单页面模式的前后端分离开发。","link":"/hexo-blog/2019/04/30/vue-cli/"}],"tags":[{"name":"ArcGIS","slug":"ArcGIS","link":"/hexo-blog/tags/ArcGIS/"},{"name":"博客，简介","slug":"博客，简介","link":"/hexo-blog/tags/博客，简介/"},{"name":"服务器，nginx","slug":"服务器，nginx","link":"/hexo-blog/tags/服务器，nginx/"},{"name":"VUE，quasar","slug":"VUE，quasar","link":"/hexo-blog/tags/VUE，quasar/"}],"categories":[{"name":"ArcGIS","slug":"ArcGIS","link":"/hexo-blog/categories/ArcGIS/"},{"name":"什么是ArcGIS","slug":"ArcGIS/什么是ArcGIS","link":"/hexo-blog/categories/ArcGIS/什么是ArcGIS/"},{"name":"博客","slug":"博客","link":"/hexo-blog/categories/博客/"},{"name":"服务器","slug":"服务器","link":"/hexo-blog/categories/服务器/"},{"name":"VUE","slug":"VUE","link":"/hexo-blog/categories/VUE/"},{"name":"简介","slug":"博客/简介","link":"/hexo-blog/categories/博客/简介/"},{"name":"nginx","slug":"服务器/nginx","link":"/hexo-blog/categories/服务器/nginx/"},{"name":"vue-cli","slug":"VUE/vue-cli","link":"/hexo-blog/categories/VUE/vue-cli/"}]}